In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [4]:
df1 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                 columns=['one', 'two'])

In [5]:
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
        columns=['three', 'four'])

In [6]:
df2

   three  four
a      5     6
c      7     8

In [7]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [9]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [10]:
pd.concat({'level1': df1, 'level2': df2}, axis=1, sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [11]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [12]:
df1

          a         b         c         d
0  1.269408  1.120647 -1.263044  1.745903
1  1.200763 -0.048636  0.816939 -0.546200
2 -0.502472  1.949007  1.678595 -0.191029

In [13]:
df2

          b         d         a
0 -0.428595 -0.645701 -0.283119
1 -0.168707  1.400906 -0.539642

In [15]:
pd.concat([df1, df2], ignore_index=True, sort=False)

          a         b         c         d
0  1.269408  1.120647 -1.263044  1.745903
1  1.200763 -0.048636  0.816939 -0.546200
2 -0.502472  1.949007  1.678595 -0.191029
3 -0.283119 -0.428595       NaN -0.645701
4 -0.539642 -0.168707       NaN  1.400906